{
  "format": "layers-model",
  "generatedBy": "TensorFlow.js tfjs-layers v4.10.0",
  "convertedBy": "Custom Node.js Generator v1.0.0",
  "modelTopology": "{\"class_name\":\"Sequential\",\"config\":{\"name\":\"sequential_1\",\"layers\":[{\"class_name\":\"Conv2D\",\"config\":{\"filters\":32,\"kernel_initializer\":{\"class_name\":\"VarianceScaling\",\"config\":{\"scale\":1,\"mode\":\"fan_avg\",\"distribution\":\"normal\",\"seed\":null}},\"kernel_regularizer\":null,\"kernel_constraint\":null,\"kernel_size\":{\"0\":3,\"1\":3},\"strides\":{\"0\":1,\"1\":1},\"padding\":\"valid\",\"data_format\":\"channels_last\",\"dilation_rate\":[1,1],\"activation\":\"relu\",\"use_bias\":true,\"bias_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"bias_regularizer\":null,\"activity_regularizer\":null,\"bias_constraint\":null,\"name\":\"conv2d_1\",\"trainable\":true,\"batch_input_shape\":[null,224,224,3],\"dtype\":\"float32\"}},{\"class_name\":\"MaxPooling2D\",\"config\":{\"pool_size\":{\"0\":2,\"1\":2},\"padding\":\"valid\",\"strides\":{\"0\":2,\"1\":2},\"data_format\":\"channels_last\",\"name\":\"max_pooling2d_1\",\"trainable\":true}},{\"class_name\":\"Conv2D\",\"config\":{\"filters\":64,\"kernel_initializer\":{\"class_name\":\"VarianceScaling\",\"config\":{\"scale\":1,\"mode\":\"fan_avg\",\"distribution\":\"normal\",\"seed\":null}},\"kernel_regularizer\":null,\"kernel_constraint\":null,\"kernel_size\":{\"0\":3,\"1\":3},\"strides\":{\"0\":1,\"1\":1},\"padding\":\"valid\",\"data_format\":\"channels_last\",\"dilation_rate\":[1,1],\"activation\":\"relu\",\"use_bias\":true,\"bias_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"bias_regularizer\":null,\"activity_regularizer\":null,\"bias_constraint\":null,\"name\":\"conv2d_2\",\"trainable\":true}},{\"class_name\":\"MaxPooling2D\",\"config\":{\"pool_size\":{\"0\":2,\"1\":2},\"padding\":\"valid\",\"strides\":{\"0\":2,\"1\":2},\"data_format\":\"channels_last\",\"name\":\"max_pooling2d_2\",\"trainable\":true}},{\"class_name\":\"GlobalAveragePooling2D\",\"config\":{\"data_format\":\"channels_last\",\"name\":\"global_average_pooling2d_1\",\"trainable\":true}},{\"class_name\":\"Dense\",\"config\":{\"units\":128,\"activation\":\"relu\",\"use_bias\":true,\"kernel_initializer\":{\"class_name\":\"VarianceScaling\",\"config\":{\"scale\":1,\"mode\":\"fan_avg\",\"distribution\":\"normal\",\"seed\":null}},\"bias_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"kernel_regularizer\":null,\"bias_regularizer\":null,\"activity_regularizer\":null,\"kernel_constraint\":null,\"bias_constraint\":null,\"name\":\"dense_1\",\"trainable\":true}},{\"class_name\":\"Dense\",\"config\":{\"units\":10,\"activation\":\"softmax\",\"use_bias\":true,\"kernel_initializer\":{\"class_name\":\"VarianceScaling\",\"config\":{\"scale\":1,\"mode\":\"fan_avg\",\"distribution\":\"normal\",\"seed\":null}},\"bias_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"kernel_regularizer\":null,\"bias_regularizer\":null,\"activity_regularizer\":null,\"kernel_constraint\":null,\"bias_constraint\":null,\"name\":\"predictions\",\"trainable\":true}}]},\"keras_version\":\"tfjs-layers 4.10.0\",\"backend\":\"tensor_flow.js\"}",
  "weightsManifest": [
    {
      "paths": [
        "model_updated.bin"
      ],
      "weights": [
        {
          "name": "conv2d_1/kernel",
          "shape": [
            3,
            3,
            3,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_1/bias",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_2/kernel",
          "shape": [
            3,
            3,
            32,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_2/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/kernel",
          "shape": [
            64,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/bias",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "predictions/kernel",
          "shape": [
            128,
            10
          ],
          "dtype": "float32"
        },
        {
          "name": "predictions/bias",
          "shape": [
            10
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}